In [1]:
import numpy as np
import pandas as pd
import scipy.stats as sp

In [20]:
%precision 2
pd.set_option('precision', 2)
np.set_printoptions(precision=2)  # 출력 옵션 변경

In [2]:
num1 = [7, 6, 3, 3, 1]
num2 = [3, 4, 4, 5, 4]
num3 = [4, 4, 4, 4, 4]

print(np.mean(num1), np.mean(num2), np.mean(num3))

4.0 4.0 4.0

In [3]:
# 조선 왕들의 수명의 범위 조사
kings = [73, 62, 45, 53, 38, 16, 51, 28, 37, 30, 56, 30, 33, 56, 66, 54, 40, 33, 59, 36, 82, 48, 44, 22, 32, 67, 52]

max = np.max(kings)
min = np.min(kings)
range = max - min
print(min, max, range)

16 82 66

In [4]:
# 대학원생들의 나이 범위 조사
studs = [19, 18, 19, 21, 20, 24, 19, 19, 20, 18, 21, 22, 23, 21, 19, 18, 22, 24, 21, 18, 19]

max = np.max(studs)
min = np.min(studs)
range = max - min

print(min, max, range)

18 24 6

# 분산

* 평균을 중심으로 밀집되거나 퍼짐 정도를 나타내는 척도
* 모분산 $ \sigma^2 $: 모집단을 구성하는 모든 자료값과 모평균의 편차제곱에 대한 평균
* 표본분산 $ s^2 $: 표본을 구성하는 모든 자료값과 표본평균의 편차의 제곱합을 n-1로 나눈 수치

* 편차
> $(x_{i}) - \bar{x})$

* 편차제곱
> $(x_{i} - \bar{x})^2$

* 모분산
> $\frac{\sum(x_{i} - \bar{x}^2)}{N}$

* 표본분산
> $\frac{\sum(x_{i} - \bar{x}^2)}{n-1}$

In [10]:
nums = [5, 8, 5, 4, 6, 7, 8, 8, 3, 6]

mean = np.mean(nums)
print(mean)

devi = nums - mean    # 편차
print(devi, np.sum(devi))   # 편차 합은 0이 됨

devi = (nums - mean) ** 2   # 편차제곱
print(devi, np.sum(devi))    # 편차제곱 합은 양수가 됨

print(np.sum(devi) / len(nums))   # 편차제곱 합을 데이터 갯수로 나눔 -> 편차제곱의 평균 - 분산

print(np.var(nums))   # 모분산
print(np.var(nums, ddof=1))   # 표본분산

6.0
[-1.  2. -1. -2.  0.  1.  2.  2. -3.  0.] 0.0
[1. 4. 1. 4. 0. 1. 4. 4. 9. 0.] 28.0
2.8
2.8
3.111111111111111

In [11]:
# 1조와 4조의 비상금 차이
teamOne = [30, 26, 40, 28, 26]
teamFour = [35, 20, 60, 15, 20]

mean1 = np.mean(teamOne)
mean2 = np.mean(teamFour)

devi1 = (teamOne - mean1) ** 2
devi2 = (teamFour - mean2) ** 2

print(mean1, np.sum(devi1))
print(mean2, np.sum(devi2))

30.0 136.0
30.0 1350.0

In [12]:
# 1조와 4조의 비상금 분산
print(np.var(teamOne, ddof=1))  # ddof: 자유도(numpy에서는 자유도 0으로 디폴트 적용)
print(np.var(teamFour, ddof=1)) # ddof=0 -> 표본의 표준편차 / ddof=1 -> 모집단의 표준편차

34.0
337.5

In [15]:
# 조선 왕들 수명의 분산 조사
kings = [73, 62, 45, 53, 38, 16, 51, 28, 37, 30, 56, 30, 33, 56, 66, 54, 40, 33, 59, 36, 82, 48, 44, 22, 32, 67, 52]

np.var(kings, ddof=1)

261.58

In [16]:
# 대학원생들 나이의 분산 조사
studs = [19, 18, 19, 21, 20, 24, 19, 19, 20, 18, 21, 22, 23, 21, 19, 18, 22, 24, 21, 18, 19]

np.var(studs, ddof=1)

3.69

# 표준편차

* 분산값에 제곱근을 취한 값
* 분산은 편차를 제곱했기 때문에 결과값의 단위 역시 제곱이 됨
* 분산의 단위를 원래 자료의 단위로 전환하기 위해 만든 값

* 모표준편차 $\sigma$
> $\sqrt \frac{\sum(x_{i} - \bar{x}^2)}{N}$

* 표본 표준편차 $s$
> $\sqrt \frac{\sum(x_{i} - \bar{x}^2)}{n-1}$

In [17]:
# 조선 왕들 수명의 표준편차 조사
kings = [73, 62, 45, 53, 38, 16, 51, 28, 37, 30, 56, 30, 33, 56, 66, 54, 40, 33, 59, 36, 82, 48, 44, 22, 32, 67, 52]

np.sqrt(np.var(kings, ddof=1))

16.17

In [18]:
# 대학원생들 나의의 표준편차 조사
studs = [19, 18, 19, 21, 20, 24, 19, 19, 20, 18, 21, 22, 23, 21, 19, 18, 22, 24, 21, 18, 19]

np.sqrt(np.var(studs, ddof=1))

1.92

In [21]:
# 카푸치노 판매점들의 5일 동안 오후 4~5시 사이의 판매량 데이터를 보고
# 어느 지점이 판매를 잘하였는지 파악하시오

A = [20, 40, 50, 60, 80]
B = [20, 45, 50, 55, 80]

# 중심화 경향 분석
print(np.mean(A), np.mean(B))
print(np.median(A), np.median(B))   # median: 중앙값

# 분산화 경향 분석
print(np.max(A) - np.min(A))
print(np.max(B) - np.min(B))

print(np.var(A, ddof=1))
print(np.var(B, ddof=1))

print(np.sqrt(np.var(A, ddof=1)))
print(np.sqrt(np.var(B, ddof=1)))   # sqrt: 제곱근

50.0 50.0
50.0 50.0
60
60
500.0
462.5
22.360679774997898
21.50581316760657

In [22]:
# 회계 수습 사원들의 월급이 3536, 3173, 3448, 3121, 3622라고 한다
# 사무 수습 사원들의 월급 평균은 3550, 표준편차는 250이라 할 때,
# 이 둘 수습사원 그룹을 비교하시오

account = [3536, 3173, 3448, 3121, 3622]

print(np.mean(account))
print(np.sqrt(np.var(account, ddof=1)))

3380.0
222.17898190422963

In [26]:
# 성적 데이터 파일을 이용한 과목별 범위, 표준편차 계산
df = pd.read_csv('/content/exams.csv')

print(np.max(df.english) - np.min(df.english))
var = np.var(df.english, ddof=1)
print(var, np.sqrt(var))

print(np.max(df.mathematics) - np.min(df.mathematics))
var = np.var(df.mathematics, ddof=1)
print(var, np.sqrt(var))

42
96.03632653061226 9.799812576300235
37
70.80163265306118 8.414370603500965

In [29]:
# 혈당 검사 데이터를 이용해서 test1, test2의 범위, 표준편차 계산
df = pd.read_csv('/content/drugtests.csv')

print(np.max(df.Test1) - np.min(df.Test1))
var = np.var(df.Test1, ddof=1)
print(var, np.sqrt(var))

print(np.max(df.Test2) - np.min(df.Test2))
var = np.var(df.Test2, ddof=1)
print(var, np.sqrt(var))

33
74.42666666666668 8.627089118970934
67
468.3566666666666 21.64154954402911

### 사원 데이터 기술통계2

In [30]:
emp = pd.read_csv('/content/employees.csv')

print(np.max(emp.SALARY) - np.min(emp.SALARY))
var = np.var(emp.SALARY, ddof=1)
print(var, np.sqrt(var))

21900
15284813.669546822 3909.5797305524825

In [31]:
emp.head()

   EMPLOYEE_ID FIRST_NAME LAST_NAME  ... COMMISSION_PCT MANAGER_ID DEPARTMENT_ID
0          100     Steven      King  ...            NaN        NaN          90.0
1          101      Neena   Kochhar  ...            NaN      100.0          90.0
2          102        Lex   De Haan  ...            NaN      100.0          90.0
3          103  Alexander    Hunold  ...            NaN      102.0          60.0
4          104      Bruce     Ernst  ...            NaN      103.0          60.0

[5 rows x 11 columns]

In [32]:
# pandas boolean indexing
emp.JOB_ID.head(10)

0       AD_PRES
1         AD_VP
2         AD_VP
3       IT_PROG
4       IT_PROG
5       IT_PROG
6       IT_PROG
7       IT_PROG
8        FI_MGR
9    FI_ACCOUNT
Name: JOB_ID, dtype: object

In [33]:
(emp.JOB_ID == 'IT_PROG').head(10)

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7     True
8    False
9    False
Name: JOB_ID, dtype: bool

In [34]:
# 조건에 일치하는 행만 추출
# 직책이 IT_PROG인 사원들의 모든 정보 추출
emp[emp.JOB_ID == 'IT_PROG']

   EMPLOYEE_ID FIRST_NAME  LAST_NAME  ... COMMISSION_PCT MANAGER_ID DEPARTMENT_ID
3          103  Alexander     Hunold  ...            NaN      102.0          60.0
4          104      Bruce      Ernst  ...            NaN      103.0          60.0
5          105      David     Austin  ...            NaN      103.0          60.0
6          106      Valli  Pataballa  ...            NaN      103.0          60.0
7          107      Diana    Lorentz  ...            NaN      103.0          60.0

[5 rows x 11 columns]

In [36]:
# 데이터프레임에 loc함수를 이용해서 조건에 일치하는 모든 변수들 중 특정 변수만 추출
sal = emp.loc[emp.JOB_ID == 'IT_PROG', 'SALARY']
print(sal)

print(np.mean(sal))
print(np.max(sal) - np.min(sal))
var = np.var(sal, ddof=1)
print(var, np.sqrt(var))

3    9000
4    6000
5    4800
6    4800
7    4200
Name: SALARY, dtype: int64
5760.0
4800
3708000.0 1925.6167843057456

### 핫도그 먹기 대회 기술통계2

In [39]:
hotdog = pd.read_csv('/content/hotdog.csv')

eats = hotdog['Dogs eaten']
print(np.max(eats) - np.min(eats))

var = np.var(eats, ddof=1)
print(var, np.sqrt(var))

58.9
361.11615161290325 19.003056375565045

### 타이타닉 생존자 기술통계2

In [42]:
titanic = pd.read_csv('/content/titanic.csv')

# titanic.tail()
age = titanic['age']
print(np.mean(age))
print(np.max(age) - np.min(age))

var = np.var(age, ddof=1)
print(var, np.sqrt(var))

29.8811345124283
79.8333
207.74897359969756 14.413499699923594

In [45]:
fare = titanic['fare']
print(np.mean(fare)) 
print(np.max(fare) - np.min(fare))

var = np.var(fare, ddof=1)
print(var, np.sqrt(var))

titanic.tail()

33.29547928134572
512.3292
2678.9597378928934 51.758668239174135

      pclass  survived                       name  ...   fare  cabin  embarked
1305     3.0       0.0      Zabour, Miss. Thamine  ...  14.45    NaN         C
1306     3.0       0.0  Zakarian, Mr. Mapriededer  ...   7.22    NaN         C
1307     3.0       0.0        Zakarian, Mr. Ortin  ...   7.22    NaN         C
1308     3.0       0.0         Zimmerman, Mr. Leo  ...   7.88    NaN         S
1309     NaN       NaN                        NaN  ...    NaN    NaN       NaN

[5 rows x 11 columns]

# 사분위수

* 데이터를 가장 작은 수부터 가장 큰 수까지 정렬하였을 때 1/4, 2/4, 3/4 위치에 있는 수를 의미
* 이 각각의 수를 `1사분위수`, `2사분위수`, `3사분위수`라고 하며, `2사분위수`는 **중앙값**과 같음
  + $Q_1$: 25% 지점
  + $Q_2$: 50% 지점 (중앙값)
  + $Q_3$: 75% 지점
* 때때로 위치를 1/100단위로 나눈 경우도 있는데, 이때 `백분위수`를 사용함
* 한편, 사분위수를 구하는 방법은 크게 **9가지**가 존재하는데, **대상 데이터의 유형**에 따라 적용방법이 다름
* numpy의 percentile함수의 interpolation 속성으로 계산 방법을 지정할 수 있음 (nearst, lower, higher, linear, midpoint)

* `사분위 범위(IQR, InterQuartile Range)`는 제3사분위수에서 제1사분위수 간의 범위
* `사분위 범위` 사이의 구간에는 항상 전체 데이터의 **50%**가 포함 됨

In [44]:
nums = [1, 1, 2, 3, 3, 3, 4, 5, 5, 7]

print(np.quantile(nums, .25))   # 1사분위수   # quantile: 변위치
print(np.quantile(nums, .5))    # 2사분위수
print(np.quantile(nums, .75))   # 3사분위수

2.25
3.0
4.75

# 변동성을 이용한 특이값 진단

* 대부분의 자료는 중심경향치 주변에 몰려있음
* 변동성 측정치를 이용하면, 중심에서 벗어난 정도를 파악할 수 있음
* 평균에서 벗어난 정도를 판단할 때는 **표준편차**를 사용
* 평균에서 표준편차의 n배 떨어져 있으면 "n 표준편차"와 같이 표현
* 중간값에서 벗어난 정도를 판단할 때는 IQR을 사용
* 중심경향치에서 크게 벗어났다면 **특이값**으로 의심할 수 있음